import requests
# 定义上述接口的 URL
url = "http://116.62.199.56:8000/"
# 发送 HTTP 请求
params = {"prompt": "被保险人于本附加合同生效(或最后复效)之日起至年满十八周岁的年生效对应日前身故,本附加合同终止,本公司按被保险人身故当时本附加合同所交保险费(不计利息)与本附加合同现金价值的较大值给付身故保险金。被保险人于年满十八周岁的年生效对应日起身故,本附加合同终止,本公司按下列约定给付身故保险金:被保险人于本附加合同生效(或最后复效)之日起一百八十日内因疾病身故,本公司按本附加合所交保险费(不计利息)给付身故保险金;被保险人因前述以外情形身故,本公司按下列约定给付身故保险金:1.被保险人于年满四十一周岁的年生效对应日前身故,本公司按被保险人身故当时本附加合同所交保险费(不计利息)的160%与本附加合同现金价值的较大值给付身故保险金;2.被保险人于年满四十一周岁的年生效对应日起至年满六十一周岁的年生效对应日前身故,本公司按被保险人身故当时本附加合同所交保险费(不计利息)的140%与本附加合同现金价值的较大值给身故保险金;3.被保险人于年满六十一周岁的年生效对应日起身故,本公司按被保险人身故当时本附加合同所交保险费(不计利息)的120%与本附加合同现金价值的较大值给付身故保险金。故居上文回答身故给付多少","history":[]}
response = requests.post(url,json=params)
# 获取响应状态码
status_code = response.status_code
# 判断响应状态码是否为 200(表示成功)
print(status_code)
